# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brews
brew "ack"
brew "apr"
brew "apr-util"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bats"
brew "c-ares"
brew "cmake"
brew "composer"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "dos2unix"
brew "exercism"
brew "ffmpeg"
brew "fish"
brew "freetype"
brew "fzf"
brew "gawk"
brew "geoip"
brew "gettext"
brew "gist"
brew "git"
brew "git-sizer"
brew "glib"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "go@1.12"
brew "gpatch"
brew "grep"
brew "htop"
brew "http-server"
brew "hugo"
brew "icu4c"
brew "ipcalc"
brew "ispell"
brew "jmeter"
brew "jq"
brew "jsoncpp"
brew "lastpass-cli"
brew "libevent"
brew "libgcrypt"
brew "libgpg-error"
brew "libksba"
brew "libssh2"
brew "libtasn1"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libxslt"
brew "libyaml"
brew "luajit"
brew "minikube"
brew "mpfr"
brew "msgpack"
brew "mysql"
brew "ncdu"
brew "node@10"
brew "node@12"
brew "numpy"
brew "oniguruma"
brew "opensc"
brew "openssh"
brew "ossp-uuid"
brew "pandoc"
brew "pcre"
brew "percona-toolkit"
brew "php", link: false
brew "php-cs-fixer"
brew "php@7.1"
brew "php@7.2"
brew "php@7.3", link: true
brew "pinentry"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql"
brew "proselint"
brew "pth"
brew "pv"
brew "python"
brew "rbenv"
brew "readline", link: true
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "rsync"
brew "ruby-build"
brew "rustup-init"
brew "selenium-server-standalone"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "sqlite"
brew "sysdig"
brew "telnet"
brew "thrift"
brew "tig"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "vim"
brew "watch"
brew "wget"
brew "wireshark"
brew "xz"
brew "yamllint"
brew "yarn"
brew "ykman"

# Casks
cask "adoptopenjdk8"
cask "bartender"
cask "chromedriver"
cask "emacs"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "hazel"
cask "iterm2"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "mobster"
cask "mongodb"
cask "muzzle"
cask "slack"
cask "spectacle"
cask "visual-studio-code"
cask "xquartz"
cask "zoomus"
