# Casks
cask "gimp"
cask "iterm2"
cask "minikube"
cask "muzzle"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "xquartz"

# Taps
tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/services"
tap "thoughtbot/formulae"

# Brews
brew "ack"
brew "apr"
brew "apr-util"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bats"
brew "c-ares"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "docker-machine-driver-xhyve"
brew "dos2unix"
brew "emacs"
brew "exercism"
brew "ffmpeg"
brew "freetype"
brew "gawk"
brew "geoip"
brew "gettext"
brew "gist"
brew "git"
brew "glib"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gpatch"
brew "gpg-agent"
brew "grep", args: ["with-default-names"]
brew "hugo"
brew "icu4c"
brew "ipcalc"
brew "jmeter"
brew "jq"
brew "jsoncpp"
brew "kubernetes-helm"
brew "lastpass-cli", args: ["with-pinentry"]
brew "libevent"
brew "libgcrypt"
brew "libgpg-error"
brew "libksba"
brew "libssh2"
brew "libtasn1"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libxslt"
brew "libyaml"
brew "luajit"
brew "mongodb"
brew "mpfr"
brew "msgpack"
brew "ncdu"
brew "numpy"
brew "oniguruma"
brew "openssh"
brew "ossp-uuid"
brew "pcre"
brew "percona-toolkit"
brew "pinentry"
brew "pinentry-mac"
brew "postgresql"
brew "pth"
brew "pv"
brew "rbenv"
brew "readline", link: true
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "rsync"
brew "ruby-build"
brew "rust"
brew "selenium-server-standalone"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "sqlite"
brew "subversion"
brew "sysdig"
brew "telnet"
brew "thrift"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "vim"
brew "watch"
brew "wget"
brew "wireshark"
brew "xz"
brew "yarn"
brew "zsh"

# Node.js
#
# Linked Node.js must be last.
brew "node", link: false
brew "node@8", link: false
brew "node@6", link: true

# PHP
#
# Linked PHP must be last.
brew "homebrew/php/composer"
brew "homebrew/php/php71", link: false
brew "homebrew/php/php71-oauth"
brew "homebrew/php/php72", link: false
brew "homebrew/php/php56", link: true
brew "homebrew/php/php56-msgpack"
brew "homebrew/php/php56-oauth"
brew "homebrew/php/php56-pcntl"
brew "homebrew/php/php56-xdebug"
